# attempt 3 at installing numpy

First: Install numpy and pandas

In [1]:
import numpy as np

In [2]:
import pandas as pd

Second locate your data:

In [3]:
url = "https://raw.githubusercontent.com/MicrosoftDocs/mslearn-introduction-to-machine-learning/main/Data/ml-basics/grades.csv"
df_students = pd.read_csv(url,delimiter=',',header='infer')
df_students.head()

    Name  StudyHours  Grade
0    Dan       10.00   50.0
1  Joann       11.50   50.0
2  Pedro        9.00   47.0
3  Rosie       16.00   97.0
4  Ethan        9.25   49.0

Next, check for any null values

In [4]:
df_students.isnull().sum()

Name          0
StudyHours    1
Grade         2
dtype: int64

In [5]:
df_students[df_students.isnull().any(axis=1)]

    Name  StudyHours  Grade
22  Bill         8.0    NaN
23   Ted         NaN    NaN

Remove any inputs with null values with:

In [6]:
df_students = df_students.dropna(axis=0)
# df_students

Get averages of study hours and grades then find who studied more than the average

In [7]:
avg_study = df_students["StudyHours"].mean()
avg_grade = df_students["Grade"].mean()

print('Average weekly study hours: {:.2f}\nAverage grade: {:.2f}'.format(avg_study, avg_grade))

Average weekly study hours: 10.52
Average grade: 49.18

In [8]:
df_students[df_students.StudyHours > avg_study]

         Name  StudyHours  Grade
1       Joann       11.50   50.0
3       Rosie       16.00   97.0
6    Frederic       11.50   53.0
9    Giovanni       14.50   74.0
10  Francesca       15.50   82.0
11      Rajab       13.75   62.0
14      Jenny       15.50   70.0
19       Skye       12.00   52.0
20     Daniel       12.50   63.0
21      Aisha       12.00   64.0

Find the mean grade of those who studied above the mean amount of time

In [9]:
df_students[df_students.StudyHours > avg_study].Grade.mean()

66.7

find out how many passed (passing grade of 60) and append a new 'pass' column to the dataframe

In [10]:
passes = pd.Series(df_students['Grade'] >= 60)
df_students = pd.concat([df_students, passes.rename("Pass")], axis = 1)

In [13]:
df_students.groupby(df_students.Pass).Name.count()

Pass
False    15
True      7
Name: Name, dtype: int64

In [11]:
df_students_grade_sorted = df_students.sort_values('Grade', ascending=False)

In [17]:
df_students.groupby(df_students.Pass)['StudyHours', 'Grade'].mean()

C:\Users\simon\AppData\Local\Temp\ipykernel_14948\297934657.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  df_students.groupby(df_students.Pass)['StudyHours', 'Grade'].mean()

       StudyHours      Grade
Pass
False    8.783333  38.000000
True    14.250000  73.142857